// 文件名：story.js
// 这里只放剧本数据，不要放任何函数

const storyData = {
   
    

    
        "start": {
            text: "开始吗~",
            options: [
                { text: "是的，开始吧！", next: "00" },
                { text: "抱歉，要离开啦", next: "点击回退退出" }
            ]
        },
         "00": {
            text:"高仿版作者有话说：三创游戏，仅超级超级小范围传播，好吧 其实还没开始传播（欲知下回如何，且看晋江文学城文豪野犬二创互动式小说《横滨伪人模拟器》作者：叩门四下）小本游戏 概不存档。（有些选项后续是我编的，但大部分来源于小说）（对了啊啊啊再道个歉，明明是叶组的密码点进来的，但是是这一本的内容（）嗯...有问题我一定会改的，请告诉我www再次 十分抱歉(双手合十)",
            options: [
                { text: "继续", next: "0-0" }
        ],
        },
        "0-0": {
            text:"你醒来了,发现自己在一个陌生的房间里。呀,原来是穿越了,btw还附赠了一个？？？？模拟器（也许它在后面能帮到你）。狂风暴雨之中，似乎有什么在外面敲门...",
            options: [
                { text: "A去开门", next: "1-a",change:1 },
                { text: "B不开门", next: "1-b" }
            ]
        },
        "1-a": {
            text:"门开啦。原来只是一团黑漆漆的少年蜷缩在地上，似乎全身都湿透了。思索片刻后，你决定把他拽进屋子里。这时模拟器提醒你可以抽卡，那还说啥了，抽！",
            options: [
                { text: "A【“异能·请君勿死（体验卡）”：获得一次使用异能“请君勿死”的机会，并解锁任务“拟态：与谢野晶子”】", next: "2-a" },
                { text: "B【“异能·外套（体验卡）”：获得三次使用异能“外套”的机会，并解锁任务“拟态：尼古莱·瓦西里耶维奇·果戈里”】", next: "2-b" },
                { text: "C【“称号·外科医生的手术刀”：佩戴该称号时，获得专业外科医生的知识与经验，但同时获得“冰冷思维”。冰冷思维：你的思维如手术刀一般冰冷。摘下称号时，所有效果解除。】", next: "2-c" }
            ]
        },
        "1-b": {
            text: "（这条还暂未施工（）你选择不开门。外面的敲门声渐渐停止了，但你在一片寂静之中反而感到不安。于是开始自言自语，试图让自己冷静下来。但是突然，门又开始响了，但是这次外面传来了两个成年男子的对话，你并没有贸然相信他们的说辞，你去厨房拿了菜刀，一声不响地站在门后，外面渐渐没动静了，但是.....一转身，你发现一张像鬼张惨败的人脸贴在了窗户上面。",
            options: [
                { text: "A.拎起地上的头贴到玻璃上，让头和外面的人对视。", next: "1-b-1" },
                { text: "B.“走开啊，别打扰我们打麻将！", next: "safe" },
                { text: "C.从卧室拿手机播放BGM，然后邀请外面的人爬进来参加尸体派对。", next: "safe" },
                { text: "D.大大大大大大大哥别杀我！", next: "safe" },
                { text: "E.从厨房拿一桶可乐，放小茶几上倒一杯。啥也别说了，第一杯敬自己。", next: "safe" }
            ]
        },
        "1-b-1": {
            text: "你拎起地上的头，贴到玻璃上。但外面的那位成年男子只是轻轻挑了下眉，而后外面的两个家伙商量了一阵就破门而入了。",
            options: [
                { text: "", next: "1111" }
            ]
        },
        "2-a": {
            text: "你选择了异能“请君勿死”。少年看起来很虚弱，你在纠结是否要用掉这宝贵的一次机会的时候，地上的绷带开始像血管般蠕动，霎时间，如同蟒蛇一般狠狠地缠住了你的脖子，那个少年慢吞吞站起来，他的眼睛竟然是猩红色的？！虽然窒息感越来越重，但你暂且还没有陷入绝望。你还有一张底牌，要趁它最懈怠的时候使用...",
            options: [
                { text: "继续蛰伏，等待反击", next: "2-a-0",change:2 }
            ]
        },
        "2-a-0": {
            text: "就在你快要窒息的时候，你终于启动了异能“请君勿死”。瞬间，一股温暖的力量包裹住了你，你重新有了力气，然后，在怪物以为他已经杀死你，回收绷带的时候，你飞快地退回到了门后，紧紧把门锁上，然后大口喘气，把家里的所有门窗都锁严之后，你退到了厨房，拿着刀，躲在了门后。这时，你才有了时间去研究模拟器的抽卡功能...",
            options: [
                { text: "继续", next: "2-chouka" }
            ]
        },
        "2-b": {
            text: "你选择了异能“外套”。少年看起来很虚弱，纠结一会之后，你准备把他拖进屋里来。就在这时，地上的绷带开始像血管般蠕动，霎时间，如同蟒蛇一般狠狠地缠住了你的脚踝，然后迅速向上蔓延，缠住了你的身体。你拼命挣扎，然后咬牙发动了新获得的异能力--外套，也许是危机之中激发了你的潜力，你居然一次就成功利用外套将自己瞬移回了房间之中！你趁怪物没反应过来之前快速锁上门，拿上刀躲到了厨房门后。这时，你才有了时间去研究模拟器的抽卡功能...",
            options: [
                { text: "", next: "2-chouka",change:2 }
            ]
        },
        "2-c": {
            text: "你选择了称号“外科医生的手术刀”。外科医生的经验告诉你，少年已经没救了，也不值得救。少年的尸体待会用手推车就可以运输出去了，但家里的尸体还得切割一下。正当你这样想着的时候，染血的绷带缠住了你的脚踝，又一条好似血管的绷带缠紧了你的脖子！！！在最后的窒息来临之前，你只看清他布满红色血丝的眼睛...",
            options    :[
            { text: "继续（自动消耗一次抽卡机会转生）", next: "death-c" ,change : 1}
            ]
        },
        "2-chouka": {
            text: "模拟器的抽卡功能如下：可以通过抽卡获得异能、称号和道具。不过，每次抽卡都会【至少】消耗一次抽卡机会，而抽卡机会是有限的，第一次接触到图鉴人物或者与图鉴人物的好感关系变化可以获得抽数哦~（关系：友好-熟悉-陌生-仇敌-死敌）【注意：每个人名下的一种新关系永远只能增加一次抽卡机会~】要记得 好-好-珍-惜-生-命-哦~",
            options: [
                { text: "继续", next: "1111" }
            ]
        },
        "death-c": {
            text: "转生成功！欢迎使用横滨伪人模拟器！【检测到与一位图鉴人物关系由“陌生”变更为“仇敌”，获得一次抽牌机会。】【检测到与一位图鉴人物关系由“仇敌”变更为“死敌”，获得一次抽牌机会。】【检测到宿主死亡，所有卡牌清零。】【消耗一次抽牌机会转生，抽牌机会-1】",
            options: [
                { text: "嗯...好问题 我现在该如何设置抽卡选项呢（（（（", next: "1111" }
            ]
        },
        
        "1111": {
            text:"前面的区域以后再来探索吧~（ps:好难写哦好难做www猛灌两升聚乙二醇电解质散准备明天去医院检查 痛苦施工中....",
            options: [
                { text: "回到开始", next: "start" }
            ]
        }

    }